# Homebrew Taps
tap "anchordotdev/tap"
tap "browsers-software/tap"
tap "hashicorp/tap"
tap "jwbargsten/misc"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "smudge/smudge"
tap "tursodatabase/tap"

# Homebrew Packages
brew "awscli"
brew "azure-cli"
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "defaultbrowser"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "glib"
brew "gmailctl"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "jq"
brew "jsonnet"
brew "just"
brew "lefthook"
brew "libavif"
brew "pandoc"
brew "qemu"
brew "ripgrep"
brew "starship"
brew "tree"
brew "uv"
brew "vercel-cli"
brew "zinit"
brew "anchordotdev/tap/anchor"
brew "hashicorp/tap/terraform"
brew "jwbargsten/misc/defbro"
brew "oven-sh/bun/bun"
brew "smudge/smudge/nightlight"
brew "tursodatabase/tap/turso"

# Homebrew Casks
cask "1password-cli"
cask "arc"
cask "bettermouse"
cask "box-drive"
cask "chatgpt"
cask "claude"
cask "figma"
cask "ghostty"
cask "gitbutler"
cask "github"
cask "google-cloud-sdk"
cask "google-drive"
cask "iina"
cask "imageoptim"
cask "itsycal"
cask "keka"
cask "kekaexternalhelper"
cask "notion-calendar"
cask "onyx"
cask "openinterminal"
cask "orbstack"
cask "pearcleaner"
cask "qspace-pro"
cask "raindropio"
cask "raycast"
cask "shottr"
cask "slack-cli"
cask "spotify"
cask "tailscale"
cask "vanilla"
cask "virtualbuddy"
cask "visual-studio-code"
cask "warp"

# Homebrew Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-monaspace"

# VSCode Extensions
vscode "alefragnani.project-manager"
vscode "antfu.iconify"
vscode "antfu.vite"
vscode "astro-build.astro-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "charliermarsh.ruff"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grafana.vscode-jsonnet"
vscode "hashicorp.terraform"
vscode "jock.svg"
vscode "jorcelinojunior.chezmoi-tools"
vscode "mattfoulks.har-analyzer"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.theme-materialkit"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "romantomjak.go-template"
vscode "rooveterinaryinc.roo-cline"
vscode "saoudrizwan.claude-dev"
vscode "skellock.just"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "wizcloud.wiz-vscode"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
