# Homebrew Taps
tap "anchordotdev/tap"
tap "browsers-software/tap"
tap "hashicorp/tap"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "oven-sh/bun"
tap "smudge/smudge"

# Homebrew Packages
brew "act"
brew "awscli"
brew "azure-cli"
brew "chezmoi"
brew "coreutils"
brew "defaultbrowser"
brew "fnm"
brew "fzf"
brew "gh"
brew "glib"
brew "gmailctl"
brew "unbound"
brew "gnutls"
brew "go"
brew "golangci-lint"
brew "helm"
brew "jq"
brew "just"
brew "lefthook"
brew "lsusb"
brew "pipx"
brew "qemu"
brew "starship"
brew "tree"
brew "uv"
brew "zinit"
brew "anchordotdev/tap/anchor"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "oven-sh/bun/bun"
brew "smudge/smudge/nightlight"

# Homebrew Casks
cask "1password-cli"
cask "appcleaner"
cask "arc"
cask "bettermouse"
cask "box-drive"
cask "browsers"
cask "chatgpt"
cask "cursor"
cask "figma"
cask "ghostty"
cask "gitbutler"
cask "github"
cask "google-cloud-sdk"
cask "google-drive"
cask "hazel"
cask "iina"
cask "imageoptim"
cask "itsycal"
cask "keka"
cask "kekaexternalhelper"
cask "onyx"
cask "openinterminal"
cask "orbstack"
cask "raindropio"
cask "raycast"
cask "shottr"
cask "slack-cli"
cask "spotify"
cask "tailscale"
cask "visual-studio-code"
cask "yaak"

# Homebrew Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-monaspace"

# VSCode Extensions
vscode "alefragnani.project-manager"
vscode "antfu.iconify"
vscode "antfu.vite"
vscode "astro-build.astro-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.npm-intellisense"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "grafana.vscode-jsonnet"
vscode "hashicorp.terraform"
vscode "jdinhlife.gruvbox"
vscode "mattfoulks.har-analyzer"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "nicolaiverbaarschot.alabaster-variant-theme"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "saoudrizwan.claude-dev"
vscode "tamasfe.even-better-toml"
vscode "task.vscode-task"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vitest.explorer"
vscode "wizcloud.wiz-vscode"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
